{"version":"1","records":[{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity"},"type":"lvl1","url":"/assignment","position":0},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity"},"content":"","type":"content","url":"/assignment","position":1},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Learning Objectives"},"type":"lvl2","url":"/assignment#learning-objectives","position":2},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Learning Objectives"},"content":"Understand algorithm efficiency from a computational perspective\n\nAnalyze the ethical and theological dimensions of optimization\n\nReflect on stewardship as a framework for technological design\n\nRecognize how design choices reflect values and worldviews","type":"content","url":"/assignment#learning-objectives","position":3},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"The Doctrine of Creation and Stewardship"},"type":"lvl2","url":"/assignment#the-doctrine-of-creation-and-stewardship","position":4},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"The Doctrine of Creation and Stewardship"},"content":"This assignment is grounded in the Christian doctrine of creation and the concept of stewardship. The Christian doctrine of creation teaches that God is the Creator of all things, and that humans, created in God’s image, are called to be stewards—not exploiters—of creation. This is not merely about environmental care; it extends to how we design and deploy all systems, including computational systems. For this reason, we will start by defining some key theological principles that inform our understanding of efficiency and optimization.\n\n1. God Creates with Wisdom and Order\n\n“How many are your works, Lord! In wisdom you made them all” (Psalm 104:24). God designed the cosmos with intricate patterns, relationships, and efficiency. Creation itself reflects divine wisdom in how systems are organized and sustained.\n\n2. Humans Bear God’s Image and Share in His Responsibility\n\nHumans are made in God’s image (Genesis 1:26-28) and are called to “tend the garden” and “subdue the earth”—but the imagery is of a gardener, not a miner. A gardener must show “great sensitivity to resources available and the bounty of God.” Our authority is limited; we are stewards, not ultimate owners. \n\nPobee, 1985\n\n3. All Authority is Exercised Under God’s Authority\n\nWhen humans rule over creation, they do so as delegated stewards under God’s sovereignty. We are “neither omniscient nor all-powerful” and “do not have power and freedom to perform at will.” Our power and creativity are circumscribed by responsibility. \n\nPobee, 1985\n\n4. Creation is Ordered and Good\n\nGod created a cosmos—a world system marked by order, beauty, and internal relationships held together by design. Each element has been assigned “its place and proper name” by the Creator. This ordering reflects God’s nature: “Whatever in creation manifests goodness, truth, and beauty is a pointer to and reflection of what its Creator God essentially and eternally is.” \n\nGunton, 2001\n\n5. Technological Development Must Be Responsible\n\n“If creation is by the decisive will of God, then the use of the created order must take seriously the intention and will of God in creating the world. This means that technological and scientific invention and use must be responsible to the moral order.” \n\nPobee, 1985 We are accountable for how we design and deploy our technologies.","type":"content","url":"/assignment#the-doctrine-of-creation-and-stewardship","position":5},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Inefficiency as a Form of Disorder","lvl2":"The Doctrine of Creation and Stewardship"},"type":"lvl3","url":"/assignment#inefficiency-as-a-form-of-disorder","position":6},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Inefficiency as a Form of Disorder","lvl2":"The Doctrine of Creation and Stewardship"},"content":"What is Inefficiency?\n\nIn algorithms and systems, inefficiency means:\n\nWasted computational resources (CPU cycles, memory, bandwidth)\n\nUnnecessary complexity that obscures intent and increases maintenance burden\n\nMisaligned design with the actual problem structure\n\nExtraction of more from creation than is needed\n\nFrom a Creation perspective, inefficiency represents several failures:\n\nDisorder (Against God’s Creative Order)God created a cosmos—ordered and beautiful. An inefficient algorithm is chaotic in its relationship to the problem. It imposes unnecessary work on the system rather than discovering and reflecting the problem’s inherent structure.\n\nWaste (Against Stewardship)Stewardship means using resources wisely. An inefficient algorithm wastes computational resources—energy, processing power, memory—that could be used for other purposes or preserved. In a finite system, waste here means less available elsewhere.\n\nDisrespect for the Created Order (Against Recognition of Limits)An inefficient system treats computational resources as infinite. But they are finite. The same finiteness principle that limits extraction of natural resources also limits computational resources.\n\nFailure of Wisdom (Against Divine Pattern)Wisdom in creation means discovering and working with the inherent structure of things, not against it. An inefficient algorithm represents ignorance or indifference to the problem’s actual structure.","type":"content","url":"/assignment#inefficiency-as-a-form-of-disorder","position":7},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Efficiency as an Expression of Stewardship","lvl2":"The Doctrine of Creation and Stewardship"},"type":"lvl3","url":"/assignment#efficiency-as-an-expression-of-stewardship","position":8},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Efficiency as an Expression of Stewardship","lvl2":"The Doctrine of Creation and Stewardship"},"content":"What is Efficiency?\n\nEfficiency in algorithm design means:\n\nDiscovering the problem’s structure and designing solutions that align with it\n\nMinimizing unnecessary work and resource consumption\n\nUsing precisely what is needed, no more\n\nRespecting the limits of the system and the finiteness of resources\n\nFrom this perspective, we have to think about how efficiency shows a respect for Creation.\n\nHonors the Creator’s DesignEfficient algorithms reflect the reality that creation is designed with order and beauty. By creating efficient algorithms, we align ourselves with that order rather than against it.\n\nFulfills Our Role as Image-BearersWisdom is fundamental to who God is. When we seek efficient solutions, we participate in divine wisdom. We think carefully about the problem, observe its patterns, and design accordingly.\n\nExercises Genuine Stewardship“Stewardship emphasizes and seeks to enhance value; proper stewardship may demand considerable sacrifice by the steward.” \n\nLim, 1990 Creating an efficient algorithm requires more thought, care, and sometimes sacrifice (of programmer time) to preserve resources.\n\nRecognizes Our LimitsAn efficient design acknowledges that resources are finite and that we are not omnipotent. It says: “This system is not infinite. We must work within its constraints wisely.” \n\nLim, 1990\n\nProtects the VoicelessWasted computational resources have real impacts—higher energy consumption, larger carbon footprints, slower systems that exclude those with limited bandwidth, devices that become obsolete faster. “People should speak and act on behalf of the voiceless.” \n\nLim, 1990 Efficient design is a form of justice.\n\nPsalm 104 and the Wonder of Efficiency\n\nPsalm 104 celebrates the beauty and order of creation—how God sustains systems with elegance. The water cycle, ecosystems, the food chain—all operate with intricate efficiency. When we design efficient algorithms, we are recognizing and reflecting something true about how creation actually works.","type":"content","url":"/assignment#efficiency-as-an-expression-of-stewardship","position":9},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"The Assignment"},"type":"lvl2","url":"/assignment#the-assignment","position":10},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"The Assignment"},"content":"Now that we have established the theological framework, here is the assignment that you will complete.","type":"content","url":"/assignment#the-assignment","position":11},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 1: Analyze an Inefficient Algorithm","lvl2":"The Assignment"},"type":"lvl3","url":"/assignment#part-1-analyze-an-inefficient-algorithm","position":12},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 1: Analyze an Inefficient Algorithm","lvl2":"The Assignment"},"content":"You will be given (or choose) an inefficient algorithm that solves a common computational problem. Your task is to:\n\nUnderstand the Problem\nWhat is the algorithm trying to solve? What are the inputs, outputs, and constraints?\n\nAnalyze the Inefficiency\n\nTrace through the algorithm step by step.\n\nCalculate its time and space complexity.\n\nIdentify where unnecessary work is being performed.\n\nDescribe the mismatch between the problem’s structure and the algorithm’s approach.\n\nVisualize the Impact\nCreate a table or graph showing:\n\nHow the algorithm performs as input size grows (n=10, 100, 1000, 10,000...)\n\nRough estimates of CPU cycles or memory used at each scale\n\nCompare this to what a reasonable solution might require","type":"content","url":"/assignment#part-1-analyze-an-inefficient-algorithm","position":13},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 2: Propose an Optimized Solution","lvl2":"The Assignment"},"type":"lvl3","url":"/assignment#part-2-propose-an-optimized-solution","position":14},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 2: Propose an Optimized Solution","lvl2":"The Assignment"},"content":"Design and implement a more efficient algorithm that solves the same problem. You should:\n\nDiscover the Problem’s Structure\nWhat patterns or relationships does the problem have that a better solution could exploit?\n\nIs there an ordering we can use?\n\nAre there overlapping subproblems?\n\nCan we transform the problem into a different representation?\n\nDesign the Optimized Algorithm\n\nClearly describe your approach\n\nAnalyze its time and space complexity\n\nExplain why your solution is more efficient\n\nImplement and Test\n\nProvide working code (or pseudocode)\n\nTest on the same input sizes as the original\n\nDemonstrate the improvement","type":"content","url":"/assignment#part-2-propose-an-optimized-solution","position":15},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 3: Reflection on Stewardship","lvl2":"The Assignment"},"type":"lvl3","url":"/assignment#part-3-reflection-on-stewardship","position":16},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 3: Reflection on Stewardship","lvl2":"The Assignment"},"content":"Write a 2-3 page reflection addressing the following questions. Ground your reflection in the theological materials provided (you should cite at least 3 specific passages or concepts):\n\nQuestion 1: Discovering Creation’s Order\n\nThe theological texts emphasize that God created the world with wisdom and order. As you optimized the algorithm, what did you discover about the problem’s inherent structure? How is an optimized algorithm a form of “discovering” rather than “inventing”?\n\nQuestion 2: Stewardship and Resources\n\nThe doctrine of creation teaches that we are called to be stewards—showing great sensitivity to resources available. How many additional CPU cycles, memory, or energy does the inefficient algorithm waste compared to your optimized version? What does this waste represent, and why should we care?\n\nConsider: If this inefficient algorithm were used in a system deployed at scale (millions of devices, running continuously), what would be the cumulative impact? Who might be affected by that waste?\n\nQuestion 3: The Ethics of Power\n\nHuman authority over creation is “circumscribed” and we are “neither omniscient nor all-powerful.” An inefficient algorithm often represents a kind of laziness—taking the easy approach rather than the wise approach. How does optimization represent a form of humility and responsibility?\n\nQuestion 4: Am I Designing Systems as a Steward or as an Extractor?\n\nReflect on this core question: “Am I designing and deploying these systems as a steward of God’s creation, or am I complicit in extraction, exploitation, or disorder?”\n\nConsider:\n\nCould the inefficient algorithm be acceptable in some contexts but not others?\n\nWhat if optimization required trade-offs (e.g., less readable code, more development time)? How would you decide?\n\nHow does this question apply to real systems you interact with (social media, search engines, cloud services)?","type":"content","url":"/assignment#part-3-reflection-on-stewardship","position":17},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Assignment Checklist"},"type":"lvl2","url":"/assignment#assignment-checklist","position":18},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Assignment Checklist"},"content":"To track your progress, use the checklist below:\n\nAnalysis (Part 1):\n\nClearly articulate the problem and the inefficient algorithm\n\nCalculate and explain time/space complexity\n\nIdentify sources of inefficiency with specific examples\n\nProvide visualization or data showing impact at scale\n\nOptimization (Part 2):\n\nPropose a more efficient algorithm with clear explanation\n\nAnalyze complexity of new algorithm\n\nImplement working code with reasonable test cases\n\nDemonstrate measurable improvement\n\nExplain the insight or pattern you discovered\n\nReflection (Part 3):\n\nAddress all four questions thoroughly\n\nCite at least 3 specific theological concepts from provided texts\n\nConnect abstract theological ideas to concrete algorithm design decisions\n\nReflect honestly on personal responsibility and choices\n\nDemonstrate understanding of stewardship as a framework for technical work","type":"content","url":"/assignment#assignment-checklist","position":19},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Grading Rubric (100 points total)"},"type":"lvl2","url":"/assignment#grading-rubric-100-points-total","position":20},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Grading Rubric (100 points total)"},"content":"","type":"content","url":"/assignment#grading-rubric-100-points-total","position":21},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 1: Analysis (25 points)","lvl2":"Grading Rubric (100 points total)"},"type":"lvl3","url":"/assignment#part-1-analysis-25-points","position":22},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 1: Analysis (25 points)","lvl2":"Grading Rubric (100 points total)"},"content":"Clarity (8 pts): Algorithm and problem are clearly explained; complexity analysis is correct and well-justified\n\nDepth (10 pts): Thorough identification of inefficiencies; good visualization of impact; evidence of careful tracing through the code\n\nInsight (7 pts): Shows understanding of why the algorithm is inefficient, not just what it does","type":"content","url":"/assignment#part-1-analysis-25-points","position":23},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 2: Optimization (35 points)","lvl2":"Grading Rubric (100 points total)"},"type":"lvl3","url":"/assignment#part-2-optimization-35-points","position":24},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 2: Optimization (35 points)","lvl2":"Grading Rubric (100 points total)"},"content":"Correctness (12 pts): Optimized algorithm is correct and actually more efficient; code is functional\n\nInsight (12 pts): Clear explanation of the pattern or structure discovered; demonstrates genuine understanding of the problem\n\nImplementation (11 pts): Code is reasonably clean and well-commented; testing demonstrates the improvement","type":"content","url":"/assignment#part-2-optimization-35-points","position":25},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 3: Reflection (40 points)","lvl2":"Grading Rubric (100 points total)"},"type":"lvl3","url":"/assignment#part-3-reflection-40-points","position":26},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl3":"Part 3: Reflection (40 points)","lvl2":"Grading Rubric (100 points total)"},"content":"Theological Engagement (12 pts): Accurate and meaningful use of at least 3 theological concepts; demonstrates understanding of creation doctrine and stewardship\n\nConnection to Practice (12 pts): Reflections are grounded in the specific algorithm and optimization choices; not generic or superficial\n\nCritical Thinking (10 pts): Acknowledges complexity; considers trade-offs; doesn’t reduce stewardship to simplistic rules\n\nPersonal Responsibility (6 pts): Shows honest reflection on choices and their implications; not defensive","type":"content","url":"/assignment#part-3-reflection-40-points","position":27},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Suggested Algorithms for Analysis"},"type":"lvl2","url":"/assignment#suggested-algorithms-for-analysis","position":28},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Suggested Algorithms for Analysis"},"content":"Choose one, or propose your own:\n\nSorting: Bubble sort vs. Merge sort or Quick sort\n\nSearch: Linear search vs. Binary search (on sorted data)\n\nData Structure Traversal: Nested loop finding duplicates vs. Hash set approach\n\nFibonacci: Naive recursive vs. Dynamic programming\n\nString Matching: Naive substring search vs. KMP or Boyer-Moore\n\nGraph Traversal: Depth-first search (DFS) with inefficient data structures vs. optimized DFS\n\nMatrix Operations: Naive matrix multiplication vs. optimized approaches\n\nDatabase Queries: Full table scan vs. Indexed query","type":"content","url":"/assignment#suggested-algorithms-for-analysis","position":29},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Discussion Prompts (for Class Conversation)"},"type":"lvl2","url":"/assignment#discussion-prompts-for-class-conversation","position":30},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Discussion Prompts (for Class Conversation)"},"content":"Before or after submitting:\n\n“Is optimization always ethically necessary, or are there contexts where ‘good enough’ is appropriate?”\n\n“Many real-world systems prioritize features and speed-to-market over efficiency. How do we balance business pressures with stewardship values?”\n\n“Cloud computing abstracts away resource costs. Does this make it easier to be wasteful? What’s our responsibility?”\n\n“Some argue that worrying about optimization in the age of powerful hardware is ‘premature optimization.’ How would a creation theology perspective respond to that?”\n\n“AI and machine learning models are often massive and energy-intensive. Does the theological framework we’ve discussed change how you think about these systems?”","type":"content","url":"/assignment#discussion-prompts-for-class-conversation","position":31},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Appendix: Psalm 104 (Selected Verses)"},"type":"lvl2","url":"/assignment#appendix-psalm-104-selected-verses","position":32},{"hierarchy":{"lvl1":"Wisdom in Optimization: A Learning Activity","lvl2":"Appendix: Psalm 104 (Selected Verses)"},"content":"Praise the Lord, my soul. Lord my God, you are very great; you are clothed with splendor and majesty.\n\nHow many are your works, Lord! In wisdom you made them all; the earth is full of your creatures.\n\nThese all look to you to give them their food at the proper time. When you give it to them, they gather it up; when you open your hand, they are satisfied with good things.\n\nMay the glory of the Lord endure forever; may the Lord rejoice in his works.\n\nThe psalm celebrates God’s wisdom in design, the intricate sustainability of creation’s systems, and the responsiveness of all creatures to the Creator. When we design efficient systems, we participate in this celebration—recognizing and reflecting the wisdom already present in creation.","type":"content","url":"/assignment#appendix-psalm-104-selected-verses","position":33},{"hierarchy":{"lvl1":"Notes for Faculty"},"type":"lvl1","url":"/faculty","position":0},{"hierarchy":{"lvl1":"Notes for Faculty"},"content":"This assignment integrates three elements:\n\nTechnical Skill Development: Students practice analyzing algorithms, calculating complexity, and designing optimizations—core CS competencies.\n\nTheological Literacy: Students engage seriously with creation doctrine, stewardship, and the ethics of technological power. They learn that these are not separate from “technical” concerns but foundational to how we think about technology.\n\nVocational Reflection: Students begin to see themselves as agents with moral responsibility in their technical work. The question “Am I designing as a steward or as an extractor?” becomes a touchstone for their professional identity.\n\nTips for Implementation:\n\nStart in class: Have students analyze a simple inefficient algorithm together before assigning individual work. Model the reflection questions.\n\nProvide examples: Showing one complete example (inefficient algorithm → analysis → optimization → reflection) helps students understand expectations.\n\nEmphasize honesty in reflection: Students may initially give “right answers” about stewardship without real engagement. Create space for genuine wrestling with questions. A honest “I wasn’t thinking about this before” is better than superficial reflection.\n\nConnect to future courses: Reference this assignment in later courses when you encounter algorithms with real-world impact (databases at scale, machine learning, distributed systems). Help students see stewardship as ongoing.\n\nAdapt for different courses:\n\nDatabases: Focus on query optimization and how inefficient queries waste energy and exclude users with slow connections\n\nComputational Modeling: Focus on model efficiency, unnecessary computational complexity, and what simplified models can teach us\n\nData Structures: Use this as a through-line: each data structure choice reflects stewardship values","type":"content","url":"/faculty","position":1},{"hierarchy":{"lvl1":"Wisdom in Optimization"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Wisdom in Optimization"},"content":"","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Introduction"},"type":"lvl2","url":"/#introduction","position":2},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Introduction"},"content":"This project contains a comprehensive learning experience that connects Christian creation theology to computer science, with a focus on algorithm optimization and stewardship. This is part of the training provided by the \n\nDe Vries Institute for Global Faculty Development.\n\nThis assignment was developed with the assistance of Copilot and Claude LLM systems, under the guidance of Eric Araujo, to ensure theological accuracy and pedagogical effectiveness. The whole content was guided and reviewed in order to align with Christian teachings and academic standards. AI assisted this project in drafting, organizing, and refining the materials, but all theological claims and educational strategies were overseen by the creator (with lower ‘c’).","type":"content","url":"/#introduction","position":3},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Contents"},"type":"lvl2","url":"/#contents","position":4},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Contents"},"content":"This project is organized into four main sections:","type":"content","url":"/#contents","position":5},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"0. Orientation","lvl2":"Contents"},"type":"lvl3","url":"/#id-0-orientation","position":6},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"0. Orientation","lvl2":"Contents"},"content":"In this section you will find:\n\nA quick-start guide for instructors\n\nA summary of what makes this assignment effective\n\nSuggestions for adapting to different courses and student populations\n\nKey theological texts referenced","type":"content","url":"/#id-0-orientation","position":7},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"1. Assignment","lvl2":"Contents"},"type":"lvl3","url":"/#id-1-assignment","position":8},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"1. Assignment","lvl2":"Contents"},"content":"The complete student assignment (3 parts):\n\nPart 1: Analyze an inefficient algorithm\n\nPart 2: Design and implement an optimized version\n\nPart 3: Theological reflection on stewardship and design\n\nThis is what students will see. It includes:\n\nFull theological grounding from course materials\n\nClear assignment objectives and checklist\n\nGrading rubric\n\nSuggested algorithms to analyze\n\nDiscussion prompts for class conversation\n\nHow to use:\n\nDistribute to students at the start of the unit\n\nUse as-is, or adapt to your course/semester","type":"content","url":"/#id-1-assignment","position":9},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"2. Teaching Notes","lvl2":"Contents"},"type":"lvl3","url":"/#id-2-teaching-notes","position":10},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"2. Teaching Notes","lvl2":"Contents"},"content":"Under the Support section you will find a detailed facilitation guide for instructors:\n\nHow to frame the assignment in the first class\n\nSuggested 30-45 minute walkthrough lesson\n\nCommon student responses and how to address them\n\nDiscussion prompts (before, during, after)\n\nGrading guidance (especially for the theological reflection)\n\nWays to extend for advanced students or support struggling ones\n\nTroubleshooting tips\n\nTone guidance and faculty reflection prompts\n\nHow to use:\n\nRead this before teaching the assignment\n\nUse the walkthrough lesson in your first class\n\nReference during grading for philosophical consistency\n\nUse discussion prompts throughout the unit","type":"content","url":"/#id-2-teaching-notes","position":11},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"3. A Theology-to-CS Translation Guide","lvl2":"Contents"},"type":"lvl3","url":"/#id-3-a-theology-to-cs-translation-guide","position":12},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl3":"3. A Theology-to-CS Translation Guide","lvl2":"Contents"},"content":"Under the Translation section you will find a quick reference translating theological concepts into CS language:\n\n6 key theological concepts → CS practice mappings\n\nConcrete examples for each\n\nDecision framework for students to use while designing\n\nGlossary of theology-to-CS parallels\n\nApplication to each CS course (Algorithms, Databases, Modeling)\n\nCommon misunderstandings to avoid\n\nHow to use:\n\nShare with students as a study guide/handout\n\nReference during discussion and office hours\n\nKeep as a bookmark for your own thinking","type":"content","url":"/#id-3-a-theology-to-cs-translation-guide","position":13},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Core Message to Students"},"type":"lvl2","url":"/#core-message-to-students","position":14},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Core Message to Students"},"content":"Through this work, students should understand:\n\nYour technical choices aren’t neutral. Every algorithm, every design decision, reflects values about what matters. As a Christian engineer or computer scientist, you’re called to ask: Am I designing as a steward of God’s creation, or am I complicit in extraction and waste? That’s not a soft question. It’s foundational to how you should think about your work.","type":"content","url":"/#core-message-to-students","position":15},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"For Questions or Customization"},"type":"lvl2","url":"/#for-questions-or-customization","position":16},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"For Questions or Customization"},"content":"Feel free to adapt these materials to your context:\n\nChange algorithm examples to match your course\n\nAdjust theological depth based on your students’ backgrounds\n\nAdd specific examples from your industry/domain\n\nExtend or simplify as your course needs\n\nThe core structure—technical rigor + theological reflection + real-world connection—remains the same.","type":"content","url":"/#for-questions-or-customization","position":17},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Success Indicators"},"type":"lvl2","url":"/#success-indicators","position":18},{"hierarchy":{"lvl1":"Wisdom in Optimization","lvl2":"Success Indicators"},"content":"You’ll know this assignment is working when students:\n\nIn analysis: Understand why an algorithm is inefficient, not just that it is\n\nIn optimization: Can articulate the pattern/structure they discovered\n\nIn reflection: Ask genuinely about their responsibility, not just provide “right answers”\n\nIn class: Reference stewardship or the core question when discussing design choices\n\nBeyond this course: Consider efficiency and responsibility in other technical work\n\nEnjoy! This is deep, challenging work. Your students will remember these conversations.\n\nIt might be strange to some that I start counting at 0. Welcome to computer science!","type":"content","url":"/#success-indicators","position":19},{"hierarchy":{"lvl1":"How to Adapt This Assignment"},"type":"lvl1","url":"/adaptation","position":0},{"hierarchy":{"lvl1":"How to Adapt This Assignment"},"content":"This assignment is designed to be flexible and adaptable to different course contexts and student populations. Below are some suggestions on how to modify the assignment while maintaining its core theological and educational objectives.","type":"content","url":"/adaptation","position":1},{"hierarchy":{"lvl1":"How to Adapt This Assignment","lvl2":"For Different Courses"},"type":"lvl2","url":"/adaptation#for-different-courses","position":2},{"hierarchy":{"lvl1":"How to Adapt This Assignment","lvl2":"For Different Courses"},"content":"Some examples of how to adapt the assignment for various computer science domains:\n\nDatabases:\n\nFocus on query optimization and the impact of inefficient queries\n\nDiscuss resource consumption of full table scans vs. indexed queries\n\nConsider inclusion/exclusion of users based on system speed\n\nComputational Modeling:\n\nFocus on model complexity vs. accuracy trade-offs\n\nDiscuss carbon footprint of large models\n\nConsider: Is a simpler model better stewardship?\n\nAny Course:\n\nAdapt the “suggested algorithms” list to what you teach\n\nAdjust reflection questions to your domain\n\nKeep the core question: “Am I designing as a steward or extractor?”","type":"content","url":"/adaptation#for-different-courses","position":3},{"hierarchy":{"lvl1":"How to Adapt This Assignment","lvl2":"For Different Student Populations"},"type":"lvl2","url":"/adaptation#for-different-student-populations","position":4},{"hierarchy":{"lvl1":"How to Adapt This Assignment","lvl2":"For Different Student Populations"},"content":"Non-Christian Students:\n\nFrame as “ethical frameworks for technology design”\n\nOffer secular alternative ethical frameworks (utilitarianism, virtue ethics) for reflection\n\nThe core ideas (accountability, wisdom, responsibility) are philosophically sound across worldviews\n\nAdvanced Students:\n\nSee “Ways to Extend the Assignment” in the \n\nTeaching Notes\n\nPush toward systemic thinking (how do your choices affect others at scale?)\n\nExplore real-world case studies\n\nStruggling Students:\n\nSimplify the reflection with scaffolded templates\n\nMake reflection discussion-based instead of written\n\nFocus on the technical parts (analysis + optimization) with lighter theology load","type":"content","url":"/adaptation#for-different-student-populations","position":5},{"hierarchy":{"lvl1":"What Makes This Assignment Effective?"},"type":"lvl1","url":"/effectiveness","position":0},{"hierarchy":{"lvl1":"What Makes This Assignment Effective?"},"content":"This assignment works because it:\n\nGrounded in Core Theology - The reflection isn’t arbitrary; it comes directly from creation doctrine, stewardship concepts, and biblical teaching on human responsibility in the texts from your project\n\nTechnically Rigorous - Parts 1 & 2 are genuine CS work (analysis, optimization, implementation). The theology isn’t a distraction; it deepens the technical thinking\n\nIntegrative - It helps students see their faith and their craft as integrated, not compartmentalized\n\nSkill-Building - Students develop real habits: asking about resource usage, understanding problem structure, making intentional design choices\n\nHonest About Complexity - It acknowledges real tensions (time-to-market vs. stewardship, optimization vs. readability, perfectionism vs. intention)","type":"content","url":"/effectiveness","position":1},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors"},"type":"lvl1","url":"/quick-start","position":0},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors"},"content":"","type":"content","url":"/quick-start","position":1},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Your First Class"},"type":"lvl2","url":"/quick-start#for-your-first-class","position":2},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Your First Class"},"content":"Read the “Framing the Assignment (First Class)” section of Teaching Notes section\n\nUse the “Suggested In-Class Walkthrough” to introduce the concept\n\nDistribute the Assignment to students","type":"content","url":"/quick-start#for-your-first-class","position":3},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Ongoing Teaching"},"type":"lvl2","url":"/quick-start#for-ongoing-teaching","position":4},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Ongoing Teaching"},"content":"Use discussion prompts from Teaching Notes throughout the unit\n\nReference the Translation Guide when students ask questions like “How does this connect?”\n\nRefer to “Common Student Responses” when you hear pushback\n\nUse the Grading Rubric as you evaluate assignments","type":"content","url":"/quick-start#for-ongoing-teaching","position":5},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Office Hours"},"type":"lvl2","url":"/quick-start#for-office-hours","position":6},{"hierarchy":{"lvl1":"Quick Start Guide for Instructors","lvl2":"For Office Hours"},"content":"Help students understand their algorithm is a “choice” with theological implications\n\nUse the decision framework from Translation_Guide to help them articulate their design choices\n\nIf they’re struggling with reflection: use guided questions rather than providing answers","type":"content","url":"/quick-start#for-office-hours","position":7},{"hierarchy":{"lvl1":"Key Theological Texts Referenced"},"type":"lvl1","url":"/theological","position":0},{"hierarchy":{"lvl1":"Key Theological Texts Referenced"},"content":"This assignment draws from the course project materials:\n\nCreation Faith and Responsibility \n\nPobee, 1985 - on gardening vs. mining, stewardship, dominion as limited authority\n\nCreation and Economics \n\nLim, 1990 \n\nLim, 1990 - on technology, responsibility to moral order, stewardship\n\nIntro to Christian Theology \n\nGunton, 2001 - systematic creation doctrine, God’s sovereignty, human limitation\n\nThe Triune Creator: A Historical and Systematic Study \n\nGunton, 2001 - ethical dimensions of creation doctrine\n\nPsalm 104 - celebration of God’s wisdom in creation’s design\n\nAll theological claims in the assignment are grounded in these texts. You can cite them directly when students ask “where does this come from?”","type":"content","url":"/theological","position":1},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement"},"type":"lvl1","url":"/discussions","position":0},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement"},"content":"Use these before, during, or after the assignment:","type":"content","url":"/discussions","position":1},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"Before (To Set Up the Question)"},"type":"lvl2","url":"/discussions#before-to-set-up-the-question","position":2},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"Before (To Set Up the Question)"},"content":"“Think about a system you use regularly (Instagram, Google, your university’s email). Do you think the engineers who built it were thinking about stewardship? How can you tell?”\n\nExpected answers: Some mention privacy concerns, speed, tracking, etc. The point is to make students realize: Design choices are visible. They reveal what the designer valued.\n\n“If you were redesigning that system with stewardship in mind, what would you change?”\n\nThis helps them see that stewardship isn’t abstract—it leads to concrete design changes.","type":"content","url":"/discussions#before-to-set-up-the-question","position":3},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"During (To Deepen the Reflection)"},"type":"lvl2","url":"/discussions#during-to-deepen-the-reflection","position":4},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"During (To Deepen the Reflection)"},"content":"“You optimized this algorithm, and it’s now faster. But the optimized version is harder to read. Should you keep it? What factors matter in deciding?”\n\nThis is the real question. Optimize for what, exactly? Execution speed? Readability? Energy efficiency? Deployment ease? These are value questions.\n\n“What if you discovered that the inefficient algorithm was written by someone who was under intense time pressure and just wanted to ship something that worked? Does that change how you think about it?”\n\nThis is about judgment and grace. Stewardship doesn’t mean harsh condemnation of everyone who didn’t optimize. But it does mean awareness and intention going forward.\n\n“Many AI/ML systems are extraordinarily compute-intensive. Some researchers argue that’s worth it because the benefits (better medicine, better translation, etc.) outweigh the cost. Do you agree? How would you decide?”\n\nThis introduces genuine moral complexity. Not everything is a simple “optimize!” or “don’t optimize!” decision.","type":"content","url":"/discussions#during-to-deepen-the-reflection","position":5},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"After (To Connect to Professional Identity)"},"type":"lvl2","url":"/discussions#after-to-connect-to-professional-identity","position":6},{"hierarchy":{"lvl1":"Discussion Prompts to Deepen Engagement","lvl2":"After (To Connect to Professional Identity)"},"content":"“How will this assignment change how you think about your work as a computer scientist or engineer?”\n\nListen for: Increased awareness, intention, a sense of responsibility. These are signs the assignment worked.\n\n“When you’re in industry, what would need to be true for you to push back against shipping an inefficient system?”\n\nThis is about virtue formation—helping students imagine themselves as people of integrity in their future work.","type":"content","url":"/discussions#after-to-connect-to-professional-identity","position":7},{"hierarchy":{"lvl1":"Ways to Extend the Assignment"},"type":"lvl1","url":"/extending","position":0},{"hierarchy":{"lvl1":"Ways to Extend the Assignment"},"content":"","type":"content","url":"/extending","position":1},{"hierarchy":{"lvl1":"Ways to Extend the Assignment","lvl2":"For Advanced Students"},"type":"lvl2","url":"/extending#for-advanced-students","position":2},{"hierarchy":{"lvl1":"Ways to Extend the Assignment","lvl2":"For Advanced Students"},"content":"Option 1: Historical Investigation\n\n“Choose a real-world system (Google’s search algorithm, Facebook’s news feed, Uber’s dispatch system) that is known to have efficiency issues or to have prioritized something other than computational efficiency. Research: Why did the engineers make the choices they did? What pressures were they under? What would a stewardship-informed redesign look like?”\n\nOption 2: Ethics Case Study\n\n“Some argue that making systems too efficient can harm workers (e.g., warehouse robots that replace humans, automated systems that eliminate jobs). Research and reflect: Can efficiency and justice ever be in tension? How would you balance them?”\n\nOption 3: System Design from Scratch\n\n“Design a new system (a data structure, a caching strategy, a database schema) from first principles with stewardship in mind. What would change about how you design it if resource conservation was a primary goal from the start, not an afterthought?”","type":"content","url":"/extending#for-advanced-students","position":3},{"hierarchy":{"lvl1":"Ways to Extend the Assignment","lvl2":"For Struggling Students"},"type":"lvl2","url":"/extending#for-struggling-students","position":4},{"hierarchy":{"lvl1":"Ways to Extend the Assignment","lvl2":"For Struggling Students"},"content":"Option 1: Simplified Reflection\n\nProvide a scaffolded reflection template:\n\n“I discovered that [inefficiency] by [method]”\n\n“This matters because [resource impact]”\n\n“From a stewardship perspective, this means [principle]”\n\n“I will [action] going forward”\n\nOption 2: Discussion-Based Reflection\n\nInstead of writing 2-3 pages, have a one-on-one or small-group discussion about the assignment. Let them think out loud.\n\nOption 3: Paired Work\n\nLet students work in pairs: one writes the technical part, one leads the reflection (though both contribute).","type":"content","url":"/extending#for-struggling-students","position":5},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors"},"type":"lvl1","url":"/grading","position":0},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors"},"content":"This page will deal with the question of how to grade fairly while maintaining rigor.","type":"content","url":"/grading","position":1},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors","lvl2":"The Challenge"},"type":"lvl2","url":"/grading#the-challenge","position":2},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors","lvl2":"The Challenge"},"content":"You want to:\n\nEvaluate technical skill fairly (Part 1 & 2)\n\nEncourage honest theological reflection without requiring a particular belief (Part 3)\n\nNot punish students who are new to thinking theologically","type":"content","url":"/grading#the-challenge","position":3},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors","lvl2":"The Solution"},"type":"lvl2","url":"/grading#the-solution","position":4},{"hierarchy":{"lvl1":"Grading Guidelines for Instructors","lvl2":"The Solution"},"content":"For Parts 1 & 2 (Technical): Grade these like any rigorous CS assignment. The rubric is clear: Is the analysis correct? Is the optimization real? Does the code work?\n\nFor Part 3 (Reflection): Grade based on:\n\nEngagement: Does the student seriously engage with the texts and concepts, not blow them off?\n\nConnection: Do the theological ideas connect specifically to their algorithm, or are they generic?\n\nHonesty: Is there evidence of real thinking, or just “right answers”?\n\nDepth: Do they acknowledge complexity, trade-offs, questions they don’t have answers to?\n\nWhat NOT to grade on:\n\nWhether the student agrees with Christian theology\n\nWhether they reached a “correct” conclusion about stewardship\n\nWhether they write beautifully (though clarity helps)\n\nExample: A student writes: “I realized I never thought about whether an algorithm was efficient. I just wanted it to work. Now I see stewardship means I should think about resources. But I also wonder—if I’m working for a company that doesn’t care about this, what’s my responsibility? I don’t know.”\n\nGrade: This is A-level reflection. It’s honest, it engages the theology, it acknowledges complexity. You want more of this.","type":"content","url":"/grading#the-solution","position":5},{"hierarchy":{"lvl1":"Let's Get Started"},"type":"lvl1","url":"/initial","position":0},{"hierarchy":{"lvl1":"Let's Get Started"},"content":"","type":"content","url":"/initial","position":1},{"hierarchy":{"lvl1":"Let's Get Started","lvl2":"Framing the Assignment (First Class)"},"type":"lvl2","url":"/initial#framing-the-assignment-first-class","position":2},{"hierarchy":{"lvl1":"Let's Get Started","lvl2":"Framing the Assignment (First Class)"},"content":"Let’s start by setting the stage for students. When you introduce this assignment, it’s crucial to connect the technical work of optimization with the theological themes of creation and stewardship.\n\nIn order to hook students into the conversation, start with this core question:\n\n“Am I designing and deploying these systems as a steward of God’s creation, or am I complicit in extraction, exploitation, or disorder?”\n\nThis isn’t a soft question. It’s the kind of question that should make a computer scientist pause and think carefully about their work. Use it to open the conversation:\n\nIn Class:\n\nWrite the question on the board.\n\nDon’t explain it yet. Ask students: “When you build a system, what does this question make you wonder about?”\n\nLet them respond. You’ll likely hear answers related to: Who uses it? How much energy does it use? Is it for profit or purpose? Does it help people or manipulate them?\n\nThen say: “Today we’re going to ground this question in a specific technical practice: optimization. And we’re going to connect it to Christian theology about creation and stewardship.”","type":"content","url":"/initial#framing-the-assignment-first-class","position":3},{"hierarchy":{"lvl1":"Let's Get Started","lvl2":"Why This Matters?"},"type":"lvl2","url":"/initial#why-this-matters","position":4},{"hierarchy":{"lvl1":"Let's Get Started","lvl2":"Why This Matters?"},"content":"Many students see computer science as “neutral” or “technical”—separate from ethics and theology. This assignment challenges that assumption head-on. Key points:\n\nEvery design choice reflects values. There are no neutral systems. When you choose an inefficient algorithm, you’re saying something about your values. You’re saying: “These wasted resources don’t matter to me,” or “Speed-to-market matters more than impact,” or “I didn’t think about it.”\n\nStewardship is not optional for believers. If students claim Christian faith, they can’t compartmentalize their work into “secular” and “sacred” categories. Their technical practice is a form of discipleship.\n\nThis isn’t just about the environment. Stewardship applies to all resources, including computational resources. When a system wastes energy, it has real impacts: higher costs for users, larger carbon footprints, devices that become obsolete faster, and exclusion of people with limited bandwidth.","type":"content","url":"/initial#why-this-matters","position":5},{"hierarchy":{"lvl1":"Responses to Common Student Reactions"},"type":"lvl1","url":"/responses","position":0},{"hierarchy":{"lvl1":"Responses to Common Student Reactions"},"content":"","type":"content","url":"/responses","position":1},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 1: “Optimization Isn’t My Job—The Hardware Is Fast Enough”"},"type":"lvl2","url":"/responses#response-1-optimization-isnt-my-job-the-hardware-is-fast-enough","position":2},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 1: “Optimization Isn’t My Job—The Hardware Is Fast Enough”"},"content":"What students mean: “Why should I worry about efficiency when computers are so powerful? This feels like premature optimization.”\n\nHow to address it:\n\nIn the moment: “That’s actually a really common view, especially after the ‘Premature optimization is the root of all evil’ aphorism became popular. But here’s the thing: optimizing an algorithm often isn’t about doing extra work. It’s about recognizing structure and avoiding unnecessary work in the first place.”\n\nDeeper response: “Also, think about scale. Yes, your laptop is fast. But if your algorithm runs on a data center serving millions of users, or on mobile devices with limited batteries, or in an embedded system where power consumption matters, then efficiency isn’t optional—it’s responsible design.”\n\nTheological angle: “From a creation perspective, we don’t get to assume resources are infinite just because they’re abundant. Abundance is a gift, but a gift doesn’t authorize us to waste. A gardener doesn’t assume water is unlimited just because rain falls.”","type":"content","url":"/responses#response-1-optimization-isnt-my-job-the-hardware-is-fast-enough","position":3},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 2: “In the Real World, We Don’t Have Time for This. We Ship First, Optimize Later”"},"type":"lvl2","url":"/responses#response-2-in-the-real-world-we-dont-have-time-for-this-we-ship-first-optimize-later","position":4},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 2: “In the Real World, We Don’t Have Time for This. We Ship First, Optimize Later”"},"content":"What students mean: “Time-to-market matters more than perfection. This is idealistic.”\n\nHow to address it:\n\nAcknowledge the tension: “You’re right that there’s real pressure in industry to move fast. And sometimes good-enough is actually good enough. But that’s different from never thinking about it.”\n\nReframe: “Here’s what I think you should develop as a habit: When you’re designing a solution, spend just a little bit of time asking: ‘Is there a structure to this problem I’m not seeing? Is there a smarter way?’ Often, the optimized solution is just as easy to implement as the naive one—you just have to think about it first.”\n\nReal-world example: “Netflix engineers optimize their systems meticulously because they understand: if our system uses 10% less energy per query, across 200 million users, that’s millions of dollars saved and thousands of tons of CO₂ not emitted. That’s not just virtue—it’s business sense.”\n\nTheological angle: “And more importantly, you’re a steward. That doesn’t mean perfectionism paralysis, but it does mean intentionality. When you make a choice to ship an inefficient system, you should be doing that consciously, not just because you didn’t think about it.”","type":"content","url":"/responses#response-2-in-the-real-world-we-dont-have-time-for-this-we-ship-first-optimize-later","position":5},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 3: “This Is Mixing Religion and Computer Science. They’re Separate Domains”"},"type":"lvl2","url":"/responses#response-3-this-is-mixing-religion-and-computer-science-theyre-separate-domains","position":6},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 3: “This Is Mixing Religion and Computer Science. They’re Separate Domains”"},"content":"What students mean: “I don’t like theology bleeding into tech. They have nothing to do with each other.”\n\nHow to address it:\n\nCalmly: “I understand the impulse to keep domains separate. But here’s the thing: You can’t keep them separate. Every system you design embodies values and assumptions about the world. The question isn’t whether theology influences technology—it’s whether it influences it consciously or unconsciously.”\n\nExamples:\n\n“If you design a social media algorithm to maximize engagement, you’re making a theological claim: that human flourishing is achieved through more engagement. Is that true? Worth asking.”\n\n“If you extract as much data as possible from users to train a model, you’re making a claim about who owns that data and what matters. Is it?”\n\n“If you optimize for speed at the expense of privacy, you’re choosing speed over human dignity. That’s a values choice.”\n\nNon-preachy angle: “Look, you don’t have to agree with Christian theology to see this. Secular ethicists are asking the same questions: What are we building? For whom? What values does it reflect? This assignment is just one framework for asking those questions. It’s the Christian framework because this is a Christian university, but the underlying point—that you should think about values in design—is pretty universal.”","type":"content","url":"/responses#response-3-this-is-mixing-religion-and-computer-science-theyre-separate-domains","position":7},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 4: “I Optimized My Algorithm, but the Reflection Questions Are Too Vague”"},"type":"lvl2","url":"/responses#response-4-i-optimized-my-algorithm-but-the-reflection-questions-are-too-vague","position":8},{"hierarchy":{"lvl1":"Responses to Common Student Reactions","lvl2":"Response 4: “I Optimized My Algorithm, but the Reflection Questions Are Too Vague”"},"content":"What students mean: “I don’t know what theological answer you’re looking for. What’s the ‘right’ answer?”\n\nHow to address it:\n\nThis is actually good. It means they’re being thoughtful. Encourage it:\n\n\"Great question. And it’s important: I’m not looking for a particular theological conclusion. I’m looking for honest engagement with the questions. Here’s what matters:\n\nYou’ve actually read and thought about the theology provided\n\nYou’re connecting those ideas specifically to your algorithm—not speaking in generalities\n\nYou’re thinking critically about the tensions (e.g., ‘optimization is good, but what if it requires less readable code?’)\n\nYou’re being honest about your own choices and assumptions\n\nAn A-level reflection might say: ‘I didn’t think about stewardship when I chose my first algorithm. Now I see how I can design more responsibly. But I also realize that in industry, I might have to make trade-offs. Here’s how I’d think about those trade-offs...’\n\nA lower-level reflection would be: ‘Optimization is important because resources are finite and stewardship is important and that’s good.’\"","type":"content","url":"/responses#response-4-i-optimized-my-algorithm-but-the-reflection-questions-are-too-vague","position":9},{"hierarchy":{"lvl1":"Troubleshooting"},"type":"lvl1","url":"/troubleshooting","position":0},{"hierarchy":{"lvl1":"Troubleshooting"},"content":"“Students are just going through the motions on the reflection”\n\nTry: Emphasize in your introduction that the reflection is a core part of the assignment, not an add-on. Share examples of good reflections (anonymously, with permission) to set the standard. During office hours, ask probing questions: “What surprised you in your optimization? How does that connect to stewardship?” Push them to think beyond “I made it faster.”\n\n“The theological content feels disconnected from the algorithm stuff”\n\nTry: When students bring their work to office hours, ask: “Show me exactly where in your optimization process stewardship mattered. What would you have done differently without thinking about stewardship?” Make the connection concrete and specific.\n\n“Some students are really uncomfortable with the theology”\n\nTry: Acknowledge it in class. “I know this might feel unfamiliar. You don’t have to agree with it to engage with it. Just give it serious thought.” Consider offering an alternative reflection that uses secular ethical frameworks (utilitarianism, virtue ethics, etc.) instead.\n\n“Students are writing longer reflections, not better ones”\n\nTry: Explicitly say that length doesn’t correlate with quality. Have an example of a short, excellent reflection alongside a longer, mediocre one. Show the difference.","type":"content","url":"/troubleshooting","position":1},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough"},"type":"lvl1","url":"/walkthrough","position":0},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough"},"content":"This recommended walkthrough can be used to introduce the assignment. It takes about 30-45 minutes, depending on class discussion.","type":"content","url":"/walkthrough","position":1},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 1: Warm-Up Analysis (10 min)"},"type":"lvl2","url":"/walkthrough#step-1-warm-up-analysis-10-min","position":2},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 1: Warm-Up Analysis (10 min)"},"content":"Use bubble sort as an example (familiar to all students).\n\nShow the code:void bubble_sort(int arr[], int n) {\n    for (int i = 0; i < n; i++) {\n        for (int j = 0; j < n-i-1; j++) {\n            if (arr[j] > arr[j+1]) {\n                int temp = arr[j];\n                arr[j] = arr[j+1];\n                arr[j+1] = temp;\n            }\n        }\n    }\n}\n\nAsk:\n\nWhat is this algorithm doing?\n\nHow many comparisons and swaps does it make in the worst case for an array of size n? (n^2)\n\nWhere is it doing unnecessary work?\n\nPoint out the inefficiency: Even if the array is already sorted after the first pass, bubble sort keeps comparing. It doesn’t recognize the pattern that the data is ordered.","type":"content","url":"/walkthrough#step-1-warm-up-analysis-10-min","position":3},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 2: Introduce the Theological Frame (8 min)"},"type":"lvl2","url":"/walkthrough#step-2-introduce-the-theological-frame-8-min","position":4},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 2: Introduce the Theological Frame (8 min)"},"content":"Say something like:\n\n\"From a Christian perspective, we believe God created the universe with wisdom and order. God’s designs are elegant—they don’t waste effort or resources. Think about photosynthesis, water cycles, or how your body processes oxygen. These are all remarkably efficient.\n\nWhen we design algorithms, we’re participating in a kind of discovery. We’re asking: ‘What is the structure of this problem? What pattern can I align my solution with?’ An efficient algorithm respects that structure. An inefficient algorithm fights against it, doing unnecessary work.\n\nMore than that, we’re called to be stewards. Stewardship isn’t just about trees and soil—it’s about all resources. When we waste computational resources through inefficient design, we’re not being good stewards. We’re being exploitative.\"\n\nPause. Let this sink in.","type":"content","url":"/walkthrough#step-2-introduce-the-theological-frame-8-min","position":5},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 3: Make It Concrete (12 min)"},"type":"lvl2","url":"/walkthrough#step-3-make-it-concrete-12-min","position":6},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 3: Make It Concrete (12 min)"},"content":"Ask students to calculate:\n\nIf bubble sort runs on:\n\nA moderately sized dataset (n=1,000): ~1 million comparisons\n\nA larger dataset (n=1 million): ~1 trillion comparisons\n\nEach comparison uses energy. Not much per comparison, but at scale?\n\nCloud data centers use enormous amounts of electricity.\n\nIf a company uses an inefficient sorting algorithm for a service that processes millions of queries per day, the waste adds up.\n\nThat waste = higher operating costs passed to customers, more carbon emissions, faster device obsolescence.\n\nNow personalize it:\n\nIf you were designing the sorting function for a payment processing system that processes 100 million transactions per day, would you use bubble sort or merge sort? Why?\n\nStudents will say: “Merge sort, because it’s faster.”\n\nFollow-up: “Right. And one reason is stewardship. It’s about respecting the resources you’re using and not wasting them.”","type":"content","url":"/walkthrough#step-3-make-it-concrete-12-min","position":7},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 4: Introduce the Assignment (5 min)"},"type":"lvl2","url":"/walkthrough#step-4-introduce-the-assignment-5-min","position":8},{"hierarchy":{"lvl1":"Suggested In-Class Walkthrough","lvl2":"Step 4: Introduce the Assignment (5 min)"},"content":"Walk through the three parts:\n\nAnalyze an inefficient algorithm - show how detailed the analysis should be\n\nDesign an optimized version - emphasize the “discovery” of pattern/structure\n\nReflect theologically - these are the hard questions; they require honesty","type":"content","url":"/walkthrough#step-4-introduce-the-assignment-5-min","position":9},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide"},"type":"lvl1","url":"/theology-cs-translation-guide","position":0},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide"},"content":"","type":"content","url":"/theology-cs-translation-guide","position":1},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Creation Doctrine in Algorithm Design"},"type":"lvl2","url":"/theology-cs-translation-guide#creation-doctrine-in-algorithm-design","position":2},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Creation Doctrine in Algorithm Design"},"content":"","type":"content","url":"/theology-cs-translation-guide#creation-doctrine-in-algorithm-design","position":3},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"The Core Insight"},"type":"lvl2","url":"/theology-cs-translation-guide#the-core-insight","position":4},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"The Core Insight"},"content":"Every technical choice reflects a theological (or anti-theological) stance toward creation. Here’s how to recognize and name those connections:","type":"content","url":"/theology-cs-translation-guide#the-core-insight","position":5},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Theological Concept → CS Practice"},"type":"lvl2","url":"/theology-cs-translation-guide#theological-concept-cs-practice","position":6},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Theological Concept → CS Practice"},"content":"","type":"content","url":"/theology-cs-translation-guide#theological-concept-cs-practice","position":7},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"1. “God Creates with Wisdom and Order”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-1-god-creates-with-wisdom-and-order","position":8},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"1. “God Creates with Wisdom and Order”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: The problem you’re solving has an inherent structure.\n\nIn CS:\n\nSome algorithms are naturally more efficient than others because they align with the problem’s structure\n\nMerge sort is efficient for large datasets because it recognizes that sorting is fundamentally about dividing, conquering, and merging\n\nHash tables are efficient for lookup because they exploit the mathematical structure of hash functions\n\nDynamic programming is efficient for overlapping subproblems because it recognizes patterns in the problem\n\nYour Job: Discover the structure. Don’t fight against it.\n\nQuestion to ask: “What pattern or relationship in this problem should my solution align with?”","type":"content","url":"/theology-cs-translation-guide#id-1-god-creates-with-wisdom-and-order","position":9},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"2. “Humans Are Stewards, Not Owners”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-2-humans-are-stewards-not-owners","position":10},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"2. “Humans Are Stewards, Not Owners”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: Resources are finite and borrowed; I’m accountable for how I use them.\n\nIn CS:\n\nComputational resources (CPU, memory, bandwidth, energy) are finite\n\nMy code runs on shared infrastructure; wasting resources means less available for others\n\nI don’t own the capacity I’m using; I’m borrowing it from the system\n\nMy choices at scale affect real people (higher costs, slower devices, higher carbon emissions)\n\nYour Job: Use only what you need. Respect the limits.\n\nQuestion to ask: “What resources am I using, and am I using them wisely?”\n\nConcrete metrics:\n\nTime complexity (how much CPU time?)\n\nSpace complexity (how much memory?)\n\nI/O operations (how much disk or network?)\n\nEnergy consumption (at scale, what’s the carbon footprint?)","type":"content","url":"/theology-cs-translation-guide#id-2-humans-are-stewards-not-owners","position":11},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"3. “Inefficiency Is a Form of Disorder”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-3-inefficiency-is-a-form-of-disorder","position":12},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"3. “Inefficiency Is a Form of Disorder”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: Doing unnecessary work contradicts the order of creation.\n\nIn CS:\n\nAn inefficient algorithm is chaotic in its relationship to the problem\n\nIt forces the system to do work that isn’t necessary\n\nIt wastes energy, creates heat, requires larger power supplies, necessitates more cooling\n\nIt crowds out other legitimate uses of the resources\n\nYour Job: Minimize unnecessary work.\n\nExamples of disorder:\n\nBubble sort keeps comparing even after the array is sorted (O(n²) when the pattern is visible)\n\nLinear search through a sorted array instead of binary search (O(n) instead of O(log n))\n\nStoring the same data multiple times instead of using a pointer (space waste)\n\nRecalculating the same value repeatedly instead of memoizing (CPU waste)\n\nQuestion to ask: “Is the system doing something unnecessary here?”","type":"content","url":"/theology-cs-translation-guide#id-3-inefficiency-is-a-form-of-disorder","position":13},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"4. “Wisdom Is About Recognizing Pattern and Working Within Constraints”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-4-wisdom-is-about-recognizing-pattern-and-working-within-constraints","position":14},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"4. “Wisdom Is About Recognizing Pattern and Working Within Constraints”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: The best solutions work with the problem structure and system constraints, not against them.\n\nIn CS:\n\nWisdom in design means understanding both the problem AND the environment where it runs\n\nA brute-force algorithm might be “simple,” but it’s not wise if it times out or runs out of memory\n\nAn elegant algorithm that exploits the problem structure is wise\n\nYour Job: Understand your constraints (time limit, memory limit, dataset size, deployment environment) and design accordingly.\n\nExamples:\n\nIn an interview with tight time limits, a wise solution is one that works in that constraint\n\nIn a mobile app, a wise solution respects battery and memory limits\n\nIn a data center, a wise solution considers energy costs\n\nIn a real-time system, a wise solution respects latency requirements\n\nQuestion to ask: “What are the actual constraints? What solution respects them?”","type":"content","url":"/theology-cs-translation-guide#id-4-wisdom-is-about-recognizing-pattern-and-working-within-constraints","position":15},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"5. “We Are Accountable for Our Choices”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-5-we-are-accountable-for-our-choices","position":16},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"5. “We Are Accountable for Our Choices”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: I should be intentional about what I build. I can’t claim ignorance.\n\nIn CS:\n\nEvery algorithm choice has trade-offs (speed vs. readability, time vs. space, CPU vs. memory)\n\nI should make choices consciously, not accidentally\n\nI should be able to articulate why I chose this approach and what I’m accepting as a result\n\nYour Job: Make intentional choices and own them.\n\nExamples:\n\nIf I use an inefficient algorithm, I should be conscious that I’m doing so (e.g., “I’m prioritizing code simplicity here because the dataset is small”) rather than thoughtless\n\nIf I optimize aggressively at the cost of readability, I should know that trade-off\n\nIf I deploy a system I know is wasteful, I should be aware of the impact\n\nQuestion to ask: “Have I thought carefully about this choice, or am I just defaulting?”","type":"content","url":"/theology-cs-translation-guide#id-5-we-are-accountable-for-our-choices","position":17},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"6. “Extraction Is Different from Stewardship”","lvl2":"Theological Concept → CS Practice"},"type":"lvl3","url":"/theology-cs-translation-guide#id-6-extraction-is-different-from-stewardship","position":18},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"6. “Extraction Is Different from Stewardship”","lvl2":"Theological Concept → CS Practice"},"content":"Translation: There’s a difference between using resources wisely and exploiting them.\n\nIn CS:\n\nExtraction: Taking as much as possible without regard for impact (“move fast and break things,” data harvesting, mining user data)\n\nStewardship: Taking what you need, thoughtfully, with awareness of impact\n\nYour Job: Distinguish between these in your own design choices.\n\nExamples:\n\nExtractive: Collecting as much user data as possible because “we might need it later”\n\nStewardly: Collecting only the data necessary for the function, with user consent and privacy protection\n\nExtractive: Running the most compute-intensive algorithm because it’s slightly more accurate, ignoring energy cost\n\nStewardly: Balancing accuracy with computational cost; sometimes a simpler model is better stewardship\n\nExtractive: Using the fastest but least maintainable code to ship quickly\n\nStewardly: Finding an approach that’s efficient AND sustainable for maintenance","type":"content","url":"/theology-cs-translation-guide#id-6-extraction-is-different-from-stewardship","position":19},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Quick Decision Framework"},"type":"lvl2","url":"/theology-cs-translation-guide#quick-decision-framework","position":20},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Quick Decision Framework"},"content":"When you’re designing a solution, ask yourself:","type":"content","url":"/theology-cs-translation-guide#quick-decision-framework","position":21},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"1. Structure Question","lvl2":"Quick Decision Framework"},"type":"lvl3","url":"/theology-cs-translation-guide#id-1-structure-question","position":22},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"1. Structure Question","lvl2":"Quick Decision Framework"},"content":"“What is the problem’s inherent structure? What patterns should my solution recognize?”\n\n(Reflects: God creates with order and wisdom)","type":"content","url":"/theology-cs-translation-guide#id-1-structure-question","position":23},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"2. Resource Question","lvl2":"Quick Decision Framework"},"type":"lvl3","url":"/theology-cs-translation-guide#id-2-resource-question","position":24},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"2. Resource Question","lvl2":"Quick Decision Framework"},"content":"“What resources will my solution use, and can I minimize waste?”\n\n(Reflects: Stewardship and finitude)","type":"content","url":"/theology-cs-translation-guide#id-2-resource-question","position":25},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"3. Constraint Question","lvl2":"Quick Decision Framework"},"type":"lvl3","url":"/theology-cs-translation-guide#id-3-constraint-question","position":26},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"3. Constraint Question","lvl2":"Quick Decision Framework"},"content":"“What are the actual constraints I’m working within? Am I designing for them or ignoring them?”\n\n(Reflects: Wisdom and humility)","type":"content","url":"/theology-cs-translation-guide#id-3-constraint-question","position":27},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"4. Impact Question","lvl2":"Quick Decision Framework"},"type":"lvl3","url":"/theology-cs-translation-guide#id-4-impact-question","position":28},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"4. Impact Question","lvl2":"Quick Decision Framework"},"content":"“Who or what is affected by how efficiently or inefficiently I solve this? What’s at stake?”\n\n(Reflects: Accountability and care for others)","type":"content","url":"/theology-cs-translation-guide#id-4-impact-question","position":29},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"5. Intention Question","lvl2":"Quick Decision Framework"},"type":"lvl3","url":"/theology-cs-translation-guide#id-5-intention-question","position":30},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"5. Intention Question","lvl2":"Quick Decision Framework"},"content":"“Am I making this choice consciously and deliberately, or by accident?”\n\n(Reflects: Responsibility)","type":"content","url":"/theology-cs-translation-guide#id-5-intention-question","position":31},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Glossary: Theology → CS"},"type":"lvl2","url":"/theology-cs-translation-guide#glossary-theology-cs","position":32},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Glossary: Theology → CS"},"content":"Theological Concept\n\nCS Parallel\n\nExample\n\nGod creates with wisdom and order\n\nProblem structure exists\n\nSorted data has structure that binary search exploits\n\nStewardship\n\nResource management\n\nOptimizing space complexity respects memory limits\n\nFinitude (resources are limited)\n\nScarcity\n\nComputational power is finite; not infinite\n\nHumans are accountable\n\nCode review; testing; profiling\n\nProfiling shows where resources are being used\n\nUnnecessary work is disorder\n\nAlgorithmic waste\n\nBubble sort does O(n²) comparisons inefficiently\n\nExtraction vs. stewardship\n\nPrivacy/ethics in design\n\nData harvesting vs. minimalist data collection\n\nHumility (we have limits)\n\nUnderstanding constraints\n\nDesigning for actual device specs, not theoretical ones\n\nAll creation matters\n\nWhole-system thinking\n\nOptimizing for CPU speed might waste memory or energy","type":"content","url":"/theology-cs-translation-guide#glossary-theology-cs","position":33},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"For Each Course"},"type":"lvl2","url":"/theology-cs-translation-guide#for-each-course","position":34},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"For Each Course"},"content":"","type":"content","url":"/theology-cs-translation-guide#for-each-course","position":35},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Data Structures & Algorithms","lvl2":"For Each Course"},"type":"lvl3","url":"/theology-cs-translation-guide#data-structures-algorithms","position":36},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Data Structures & Algorithms","lvl2":"For Each Course"},"content":"The most direct application. Questions to ask:\n\nWhy is this algorithm more efficient than that one?\n\nWhere is unnecessary work happening?\n\nWhat structure in the problem does this data structure exploit?\n\nWhat resources am I trading off (time vs. space)?\n\nAssignment Angle: “Wisdom in Optimization” - exact focus","type":"content","url":"/theology-cs-translation-guide#data-structures-algorithms","position":37},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Databases","lvl2":"For Each Course"},"type":"lvl3","url":"/theology-cs-translation-guide#databases","position":38},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Databases","lvl2":"For Each Course"},"content":"Stewardship questions:\n\nA full table scan works, but is it stewardship of resources?\n\nShould this query be indexed? Why?\n\nWhat’s the human impact of a slow query?\n\nHow do I store data efficiently without losing integrity?\n\nDesign Question: “If my query currently takes 10 seconds across a million records, what happens at 100 million records? Am I designing for scale responsibly?”","type":"content","url":"/theology-cs-translation-guide#databases","position":39},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Computational Modeling","lvl2":"For Each Course"},"type":"lvl3","url":"/theology-cs-translation-guide#computational-modeling","position":40},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Computational Modeling","lvl2":"For Each Course"},"content":"Wisdom and humility questions:\n\nHow complex should my model be to be useful AND efficient?\n\nWhat am I assuming about the world, and is that wise?\n\nCan a simpler model be just as useful with better stewardship?\n\nWhat’s the carbon footprint of training this model?\n\nReflection: “What does the structure of this system teach me about how to design responsibly?”","type":"content","url":"/theology-cs-translation-guide#computational-modeling","position":41},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Common Misunderstandings to Avoid"},"type":"lvl2","url":"/theology-cs-translation-guide#common-misunderstandings-to-avoid","position":42},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Common Misunderstandings to Avoid"},"content":"","type":"content","url":"/theology-cs-translation-guide#common-misunderstandings-to-avoid","position":43},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 1: “Stewardship means I can never ship anything imperfect”","lvl2":"Common Misunderstandings to Avoid"},"type":"lvl3","url":"/theology-cs-translation-guide#misunderstanding-1-stewardship-means-i-can-never-ship-anything-imperfect","position":44},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 1: “Stewardship means I can never ship anything imperfect”","lvl2":"Common Misunderstandings to Avoid"},"content":"Correction: Stewardship isn’t perfectionism. It’s intentionality. Sometimes “good enough” is the right call. The difference is: you made that choice consciously.","type":"content","url":"/theology-cs-translation-guide#misunderstanding-1-stewardship-means-i-can-never-ship-anything-imperfect","position":45},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 2: “I can just optimize everything and call it stewardship”","lvl2":"Common Misunderstandings to Avoid"},"type":"lvl3","url":"/theology-cs-translation-guide#misunderstanding-2-i-can-just-optimize-everything-and-call-it-stewardship","position":46},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 2: “I can just optimize everything and call it stewardship”","lvl2":"Common Misunderstandings to Avoid"},"content":"Correction: Premature optimization is still a problem. Stewardship also includes readability, maintainability, and not wasting engineering time on micro-optimizations that don’t matter.","type":"content","url":"/theology-cs-translation-guide#misunderstanding-2-i-can-just-optimize-everything-and-call-it-stewardship","position":47},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 3: “Stewardship only applies to environmental systems”","lvl2":"Common Misunderstandings to Avoid"},"type":"lvl3","url":"/theology-cs-translation-guide#misunderstanding-3-stewardship-only-applies-to-environmental-systems","position":48},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 3: “Stewardship only applies to environmental systems”","lvl2":"Common Misunderstandings to Avoid"},"content":"Correction: Stewardship applies to all resources. Computational resources, data, user attention, developer time—all of these can be stewarded or squandered.","type":"content","url":"/theology-cs-translation-guide#misunderstanding-3-stewardship-only-applies-to-environmental-systems","position":49},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 4: “If I’m a student and I’m not in industry, this doesn’t apply to me yet”","lvl2":"Common Misunderstandings to Avoid"},"type":"lvl3","url":"/theology-cs-translation-guide#misunderstanding-4-if-im-a-student-and-im-not-in-industry-this-doesnt-apply-to-me-yet","position":50},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl3":"Misunderstanding 4: “If I’m a student and I’m not in industry, this doesn’t apply to me yet”","lvl2":"Common Misunderstandings to Avoid"},"content":"Correction: You’re building habits now. The way you think about your assignments today shapes how you’ll think about your work later. Start now.","type":"content","url":"/theology-cs-translation-guide#misunderstanding-4-if-im-a-student-and-im-not-in-industry-this-doesnt-apply-to-me-yet","position":51},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"The Central Question (Revisited)"},"type":"lvl2","url":"/theology-cs-translation-guide#the-central-question-revisited","position":52},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"The Central Question (Revisited)"},"content":"Everything in this guide comes back to one question:\n\n“Am I designing and deploying these systems as a steward of God’s creation, or am I complicit in extraction, exploitation, or disorder?”\n\nWhen you ask this question consistently—in code reviews, in design decisions, in algorithm choices—you’re doing something important. You’re integrating your faith and your craft. You’re recognizing that your technical work isn’t separate from your theological commitments; it’s an expression of them.\n\nThat doesn’t mean you get it right every time. But it means you’re asking.","type":"content","url":"/theology-cs-translation-guide#the-central-question-revisited","position":53},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Resources for Deeper Engagement"},"type":"lvl2","url":"/theology-cs-translation-guide#resources-for-deeper-engagement","position":54},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"Resources for Deeper Engagement"},"content":"From the Course:\n\nPobee on stewardship as gardening (sensitivity to resources)\n\nCreation & Economics texts on technology and responsibility\n\nPsalm 104 on God’s wisdom in creation\n\nCelia Deane-Drummond on wisdom and wonder as ways to understand creation\n\nFrom CS Literature:\n\nDonald Knuth’s “The Art of Computer Programming” (efficiency as art)\n\nDijkstra on simplicity and beauty in code\n\nPapers on “appropriate technology” and sustainable computing\n\nFrom Broader Ethics:\n\n“Ethics in Information Technology” by George Reynolds (secular framework for the same issues)\n\nDiscussion of dark patterns and manipulative design\n\nEnvironmental impact of computing","type":"content","url":"/theology-cs-translation-guide#resources-for-deeper-engagement","position":55},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"One More Time"},"type":"lvl2","url":"/theology-cs-translation-guide#one-more-time","position":56},{"hierarchy":{"lvl1":"Theology-to-CS Translation Guide","lvl2":"One More Time"},"content":"Remember: You’re not trying to be a theologian. You’re trying to be a thoughtful engineer—someone who recognizes that the systems you build reflect values, have impacts, and deserve intentional design.\n\nThat’s the goal.","type":"content","url":"/theology-cs-translation-guide#one-more-time","position":57}]}